package lesson1;

public class MainApp {
    //1.Создать пустой проект в IntelliJ IDEA и прописать метод main().
    public static void main(String[] args) {
        System.out.println("Hello, World!");
        //2.Создать переменные всех пройденных типов данных и инициализировать их значения.

    }
}
